Imports complete in 0.00011897087097167969 seconds
Running on cuda:0
Generated created.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                  [-1, 625]         160,625
   ConvTranspose2d-2          [-1, 256, 25, 25]           2,560
       BatchNorm2d-3          [-1, 256, 25, 25]             512
         LeakyReLU-4          [-1, 256, 25, 25]               0
   ConvTranspose2d-5          [-1, 256, 25, 25]         590,080
       BatchNorm2d-6          [-1, 256, 25, 25]             512
         LeakyReLU-7          [-1, 256, 25, 25]               0
   ConvTranspose2d-8          [-1, 128, 50, 50]         524,416
       BatchNorm2d-9          [-1, 128, 50, 50]             256
        LeakyReLU-10          [-1, 128, 50, 50]               0
  ConvTranspose2d-11          [-1, 256, 50, 50]         295,168
      BatchNorm2d-12          [-1, 256, 50, 50]             512
        LeakyReLU-13          [-1, 256, 50, 50]               0
  ConvTranspose2d-14          [-1, 128, 50, 50]         295,040
      BatchNorm2d-15          [-1, 128, 50, 50]             256
        LeakyReLU-16          [-1, 128, 50, 50]               0
  ConvTranspose2d-17          [-1, 128, 50, 50]         147,584
      BatchNorm2d-18          [-1, 128, 50, 50]             256
        LeakyReLU-19          [-1, 128, 50, 50]               0
  ConvTranspose2d-20         [-1, 64, 100, 100]         131,136
      BatchNorm2d-21         [-1, 64, 100, 100]             128
        LeakyReLU-22         [-1, 64, 100, 100]               0
  ConvTranspose2d-23        [-1, 128, 100, 100]          73,856
      BatchNorm2d-24        [-1, 128, 100, 100]             256
        LeakyReLU-25        [-1, 128, 100, 100]               0
  ConvTranspose2d-26         [-1, 64, 100, 100]          73,792
      BatchNorm2d-27         [-1, 64, 100, 100]             128
        LeakyReLU-28         [-1, 64, 100, 100]               0
  ConvTranspose2d-29         [-1, 64, 100, 100]          36,928
      BatchNorm2d-30         [-1, 64, 100, 100]             128
        LeakyReLU-31         [-1, 64, 100, 100]               0
  ConvTranspose2d-32         [-1, 32, 200, 200]          32,800
      BatchNorm2d-33         [-1, 32, 200, 200]              64
        LeakyReLU-34         [-1, 32, 200, 200]               0
  ConvTranspose2d-35         [-1, 64, 200, 200]          18,496
      BatchNorm2d-36         [-1, 64, 200, 200]             128
        LeakyReLU-37         [-1, 64, 200, 200]               0
  ConvTranspose2d-38         [-1, 32, 200, 200]          18,464
      BatchNorm2d-39         [-1, 32, 200, 200]              64
        LeakyReLU-40         [-1, 32, 200, 200]               0
  ConvTranspose2d-41         [-1, 32, 200, 200]           9,248
      BatchNorm2d-42         [-1, 32, 200, 200]              64
        LeakyReLU-43         [-1, 32, 200, 200]               0
  ConvTranspose2d-44         [-1, 16, 400, 400]           8,208
      BatchNorm2d-45         [-1, 16, 400, 400]              32
        LeakyReLU-46         [-1, 16, 400, 400]               0
  ConvTranspose2d-47         [-1, 32, 400, 400]           4,640
      BatchNorm2d-48         [-1, 32, 400, 400]              64
        LeakyReLU-49         [-1, 32, 400, 400]               0
  ConvTranspose2d-50         [-1, 16, 400, 400]           4,624
      BatchNorm2d-51         [-1, 16, 400, 400]              32
        LeakyReLU-52         [-1, 16, 400, 400]               0
  ConvTranspose2d-53         [-1, 16, 400, 400]           2,320
      BatchNorm2d-54         [-1, 16, 400, 400]              32
        LeakyReLU-55         [-1, 16, 400, 400]               0
  ConvTranspose2d-56          [-1, 3, 400, 400]             435
      BatchNorm2d-57          [-1, 3, 400, 400]               6
        LeakyReLU-58          [-1, 3, 400, 400]               0
================================================================
Total params: 2,433,850
Trainable params: 2,433,850
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 567.63
Params size (MB): 9.28
Estimated Total Size (MB): 576.92
----------------------------------------------------------------