Imports complete in 0.00011539459228515625 seconds
Running on cuda:0
Generated created.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                  [-1, 625]         160,625
   ConvTranspose2d-2          [-1, 512, 25, 25]           5,120
       BatchNorm2d-3          [-1, 512, 25, 25]           1,024
         LeakyReLU-4          [-1, 512, 25, 25]               0
   ConvTranspose2d-5          [-1, 512, 25, 25]       2,359,808
       BatchNorm2d-6          [-1, 512, 25, 25]           1,024
         LeakyReLU-7          [-1, 512, 25, 25]               0
   ConvTranspose2d-8          [-1, 256, 50, 50]       2,097,408
       BatchNorm2d-9          [-1, 256, 50, 50]             512
        LeakyReLU-10          [-1, 256, 50, 50]               0
  ConvTranspose2d-11          [-1, 512, 50, 50]       1,180,160
      BatchNorm2d-12          [-1, 512, 50, 50]           1,024
        LeakyReLU-13          [-1, 512, 50, 50]               0
  ConvTranspose2d-14          [-1, 256, 50, 50]       1,179,904
      BatchNorm2d-15          [-1, 256, 50, 50]             512
        LeakyReLU-16          [-1, 256, 50, 50]               0
  ConvTranspose2d-17          [-1, 256, 50, 50]         590,080
      BatchNorm2d-18          [-1, 256, 50, 50]             512
        LeakyReLU-19          [-1, 256, 50, 50]               0
  ConvTranspose2d-20        [-1, 128, 100, 100]         524,416
      BatchNorm2d-21        [-1, 128, 100, 100]             256
        LeakyReLU-22        [-1, 128, 100, 100]               0
  ConvTranspose2d-23        [-1, 256, 100, 100]         295,168
      BatchNorm2d-24        [-1, 256, 100, 100]             512
        LeakyReLU-25        [-1, 256, 100, 100]               0
  ConvTranspose2d-26        [-1, 128, 100, 100]         295,040
      BatchNorm2d-27        [-1, 128, 100, 100]             256
        LeakyReLU-28        [-1, 128, 100, 100]               0
  ConvTranspose2d-29        [-1, 128, 100, 100]         147,584
      BatchNorm2d-30        [-1, 128, 100, 100]             256
        LeakyReLU-31        [-1, 128, 100, 100]               0
  ConvTranspose2d-32         [-1, 64, 200, 200]         131,136
      BatchNorm2d-33         [-1, 64, 200, 200]             128
        LeakyReLU-34         [-1, 64, 200, 200]               0
  ConvTranspose2d-35        [-1, 128, 200, 200]          73,856
      BatchNorm2d-36        [-1, 128, 200, 200]             256
        LeakyReLU-37        [-1, 128, 200, 200]               0
  ConvTranspose2d-38         [-1, 64, 200, 200]          73,792
      BatchNorm2d-39         [-1, 64, 200, 200]             128
        LeakyReLU-40         [-1, 64, 200, 200]               0
  ConvTranspose2d-41         [-1, 64, 200, 200]          36,928
      BatchNorm2d-42         [-1, 64, 200, 200]             128
        LeakyReLU-43         [-1, 64, 200, 200]               0
  ConvTranspose2d-44         [-1, 32, 400, 400]          32,800
      BatchNorm2d-45         [-1, 32, 400, 400]              64
        LeakyReLU-46         [-1, 32, 400, 400]               0
  ConvTranspose2d-47         [-1, 64, 400, 400]          18,496
      BatchNorm2d-48         [-1, 64, 400, 400]             128
        LeakyReLU-49         [-1, 64, 400, 400]               0
  ConvTranspose2d-50         [-1, 32, 400, 400]          18,464
      BatchNorm2d-51         [-1, 32, 400, 400]              64
        LeakyReLU-52         [-1, 32, 400, 400]               0
  ConvTranspose2d-53         [-1, 32, 400, 400]           9,248
      BatchNorm2d-54         [-1, 32, 400, 400]              64
        LeakyReLU-55         [-1, 32, 400, 400]               0
  ConvTranspose2d-56          [-1, 3, 400, 400]             867
      BatchNorm2d-57          [-1, 3, 400, 400]               6
        LeakyReLU-58          [-1, 3, 400, 400]               0
================================================================
Total params: 9,237,754
Trainable params: 9,237,754
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 1124.27
Params size (MB): 35.24
Estimated Total Size (MB): 1159.51
----------------------------------------------------------------