Imports complete in 0.00011086463928222656 seconds
Running on cuda:0
Generated created.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                  [-1, 625]         160,625
   ConvTranspose2d-2           [-1, 64, 25, 25]             640
       BatchNorm2d-3           [-1, 64, 25, 25]             128
         LeakyReLU-4           [-1, 64, 25, 25]               0
   ConvTranspose2d-5           [-1, 64, 25, 25]          36,928
       BatchNorm2d-6           [-1, 64, 25, 25]             128
         LeakyReLU-7           [-1, 64, 25, 25]               0
   ConvTranspose2d-8           [-1, 32, 50, 50]          32,800
       BatchNorm2d-9           [-1, 32, 50, 50]              64
        LeakyReLU-10           [-1, 32, 50, 50]               0
  ConvTranspose2d-11           [-1, 64, 50, 50]          18,496
      BatchNorm2d-12           [-1, 64, 50, 50]             128
        LeakyReLU-13           [-1, 64, 50, 50]               0
  ConvTranspose2d-14           [-1, 32, 50, 50]          18,464
      BatchNorm2d-15           [-1, 32, 50, 50]              64
        LeakyReLU-16           [-1, 32, 50, 50]               0
  ConvTranspose2d-17           [-1, 32, 50, 50]           9,248
      BatchNorm2d-18           [-1, 32, 50, 50]              64
        LeakyReLU-19           [-1, 32, 50, 50]               0
  ConvTranspose2d-20         [-1, 16, 100, 100]           8,208
      BatchNorm2d-21         [-1, 16, 100, 100]              32
        LeakyReLU-22         [-1, 16, 100, 100]               0
  ConvTranspose2d-23         [-1, 32, 100, 100]           4,640
      BatchNorm2d-24         [-1, 32, 100, 100]              64
        LeakyReLU-25         [-1, 32, 100, 100]               0
  ConvTranspose2d-26         [-1, 16, 100, 100]           4,624
      BatchNorm2d-27         [-1, 16, 100, 100]              32
        LeakyReLU-28         [-1, 16, 100, 100]               0
  ConvTranspose2d-29         [-1, 16, 100, 100]           2,320
      BatchNorm2d-30         [-1, 16, 100, 100]              32
        LeakyReLU-31         [-1, 16, 100, 100]               0
  ConvTranspose2d-32          [-1, 8, 200, 200]           2,056
      BatchNorm2d-33          [-1, 8, 200, 200]              16
        LeakyReLU-34          [-1, 8, 200, 200]               0
  ConvTranspose2d-35         [-1, 16, 200, 200]           1,168
      BatchNorm2d-36         [-1, 16, 200, 200]              32
        LeakyReLU-37         [-1, 16, 200, 200]               0
  ConvTranspose2d-38          [-1, 8, 200, 200]           1,160
      BatchNorm2d-39          [-1, 8, 200, 200]              16
        LeakyReLU-40          [-1, 8, 200, 200]               0
  ConvTranspose2d-41          [-1, 8, 200, 200]             584
      BatchNorm2d-42          [-1, 8, 200, 200]              16
        LeakyReLU-43          [-1, 8, 200, 200]               0
  ConvTranspose2d-44          [-1, 4, 400, 400]             516
      BatchNorm2d-45          [-1, 4, 400, 400]               8
        LeakyReLU-46          [-1, 4, 400, 400]               0
  ConvTranspose2d-47          [-1, 8, 400, 400]             296
      BatchNorm2d-48          [-1, 8, 400, 400]              16
        LeakyReLU-49          [-1, 8, 400, 400]               0
  ConvTranspose2d-50          [-1, 4, 400, 400]             292
      BatchNorm2d-51          [-1, 4, 400, 400]               8
        LeakyReLU-52          [-1, 4, 400, 400]               0
  ConvTranspose2d-53          [-1, 4, 400, 400]             148
      BatchNorm2d-54          [-1, 4, 400, 400]               8
        LeakyReLU-55          [-1, 4, 400, 400]               0
  ConvTranspose2d-56          [-1, 3, 400, 400]             111
      BatchNorm2d-57          [-1, 3, 400, 400]               6
        LeakyReLU-58          [-1, 3, 400, 400]               0
================================================================
Total params: 304,186
Trainable params: 304,186
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 150.15
Params size (MB): 1.16
Estimated Total Size (MB): 151.31
----------------------------------------------------------------